package com.RDCD_Coop;

public class DataProviderClass{
    @org.testng.annotations.DataProvider(name = "Sodossho_Nibondhon")
    public Object[][] getdata(){

        Object[][] data = {{"1","4655155904","03011999","Asad Haq","আসাদ হক","Mr. Abc","Mrs. Abc","01968956730","1","asad@gmail.com","স্নাতকোত্তর","শিক্ষক","বিবাহিত","খুলনা","দাকোপ","দাকোপ","বাড়ি নং-৩২, রাস্তা-০৯"}
                ,{"2","19994578963254782","05051988","Hasan Uddin","হাসান উদ্দিন","Mr. Ghi","Mrs. Ghi","01858426320","1","hasan@gmail.com","এইচ.এস.সি","স্বনির্ভর","অবিবাহিত","খুলনা","দাকোপ","দাকোপ","বাড়ি নং-৫২, রাস্তা-০৮"}
                ,{"1","4655155903","03011999","Mustafizur Rahman","মোস্তাফিজুর রহমান","Mahabubur Rahman","Fazilatun Nessa","01686026037","1","testmustafizur@gmail.com","স্নাতক","বেসরকারী কর্মচারী","অবিবাহিত","খুলনা","দাকোপ","দাকোপ","বাড়ি নং-৬২, রাস্তা-০১"}
                ,{"2","19954578963254792","01051985","Hasina Khatun","হাসিনা খাতুন","Mr. Def","Mrs. Def","01768126321","2","hasina@gmail.com","অষ্টম শ্রেণী","গৃহিনী","বিবাহিত","খুলনা","দাকোপ","দাকোপ","বাড়ি নং-৮২, রাস্তা-০৬"}
                ,{"1","9855155955","02011988","Halima Akhter","হালিমা আক্তার","Mr. Jkl","Mrs. Jkl","01798566720","2","hamila@gmail.com","পঞ্চম শ্রেণী","গৃহিনী","বিবাহিত","খুলনা","দাকোপ","দাকোপ","বাড়ি নং-২২, রাস্তা-০৯"}
                ,{"2","19944569963254700","02081983","Kabir Uddin","কবির উদ্দিন","Mr. Mno","Mrs. Mno","01968456359","1","kabir@gmail.com","স্নাতক","সরকারি কর্মচারী","অবিবাহিত","খুলনা","দাকোপ","দাকোপ","ববাড়ি নং-১২, রাস্তা-০৫"}
        };
        return data;
    }
}
