package com.RDCD_Coop;

public class DataProviderClass{
    @org.testng.annotations.DataProvider(name = "Sodossho_Nibondhon")
    public Object[][] getdata(){

        Object[][] data = {{"1","4655155904","03011999","Asad Haq","আসাদ হক","Mr. Abc","Mrs. Abc","01968956730","1","asad@gmail.com","স্নাতকোত্তর","শিক্ষক","বিবাহিত","খুলনা","দাকোপ","দাকোপ","বাড়ি নং-৩২, রাস্তা-০৯"},
                {"1","4655155904","05091985","Abdul Kalam","আব্দুল কালাম","Mr. Def","Mrs. Def","01568556320","1","kalam@gmail.com","স্নাতক","বেসরকারী কর্মচারী","বিবাহিত","খুলনা","দাকোপ","দাকোপ","বাড়ি নং-৩২, রাস্তা-০৯"},
                {"2","19994578963254782","05051988","Hasan Uddin","হাসান উদ্দিন","Mr. Ghj","Mrs. Ghj","01858426320","1","hasan@gmail.com","স্নাতক","বেসরকারী কর্মচারী","অবিবাহিত","খুলনা","দাকোপ","দাকোপ","বাড়ি নং-৩২, রাস্তা-০৯"}
        };
        return data;
        //{"1","4655155904","05091985","Abdul Kalam","আব্দুল কালাম","Mr. Def","Mrs. Def","01568556320","1","kalam@gmail.com","স্নাতক","বেসরকারী কর্মচারী","বিবাহিত","খুলনা","দাকোপ","দাকোপ","বাড়ি নং-৩২, রাস্তা-০৯"},
        //{"1","4655155904","05091985","Abdul Kalam","আব্দুল কালাম","Mr. Def","Mrs. Def","01568556320","1","kalam@gmail.com","স্নাতক","বেসরকারী কর্মচারী","বিবাহিত","খুলনা","দাকোপ","দাকোপ","বাড়ি নং-৩২, রাস্তা-০৯"},
        //{"1","4655155904","05091985","Abdul Kalam","আব্দুল কালাম","Mr. Def","Mrs. Def","01568556320","1","kalam@gmail.com","স্নাতক","বেসরকারী কর্মচারী","বিবাহিত","খুলনা","দাকোপ","দাকোপ","বাড়ি নং-৩২, রাস্তা-০৯"}
    }
}
